# BASIC STATISTICS-2

#Problem Statement: Hospital Patient Data Analysis
Context

A hospital stores patient information in two different datasets:

## Dataset 1: Patient Information

Includes:

PatientID

PatientName

AdmissionDate

Department

Diagnosis

Doctor

Follow-up details

Other administrative columns

## Dataset 2: Billing Details
Includes:

PatientID

BillAmount

PaymentStatus

BillingDate

In [1]:
#import library
import pandas as pd
#Load the Billing dataset
df1 = pd.read_csv("Billing_Data.csv")
#Load the patient dataset
df2 = pd.read_csv("Patient_Data.csv")

In [2]:
df1

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [3]:
df2

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

## show summary with info().

In [4]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

# 2.	Select only the columns relevant for billing: ['PatientID', 'Department', 'Doctor', 'BillAmount'].

In [5]:
df2[['PatientID','Department','Doctor','BillAmount']]

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [6]:
df2.isnull().sum()

PatientID         0
Name              0
Department        0
Doctor            0
BillAmount        2
ReceptionistID    0
CheckInTime       0
dtype: int64

# 3.	Drop administrative columns like ['ReceptionistID', 'CheckInTime'].

In [7]:


df2.drop(["ReceptionistID","CheckInTime"],axis=1)

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

# 4.	Use groupby to find total bill amount per department.

In [8]:

df2.groupby("Department")['BillAmount']

In [9]:
df2.groupby("Department")['BillAmount'].sum()

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

 # 5.	Remove duplicate patient records based on PatientID.

In [10]:
df2.drop_duplicates("PatientID")

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

# 6.	Fill missing BillAmount values with the mean bill amount.

In [11]:
df2.fillna(df2['BillAmount'])

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [12]:

df2.fillna(df2['BillAmount'].mean())

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,5925.0,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,5925.0,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

# 7.	Merge the billing dataset with patient dataset on PatientID.

In [13]:
df1.merge(df2,on='PatientID')

,PatientID,InsuranceCovered,FinalAmount,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,2000,3000,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,101,2000,3000,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
2,102,1500,3500,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
3,103,2500,5000,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
4,104,3000,3200,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
5,105,1000,4000,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

In [14]:
df2_merged = pd.merge(df1,df2,on="PatientID",how='left')
df2_merged

,PatientID,InsuranceCovered,FinalAmount,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,2000,3000,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,101,2000,3000,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
2,102,1500,3500,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
3,103,2500,5000,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
4,104,3000,3200,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
5,105,1000,4000,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

# 8.	Concatenate an additional DataFrame that contains new patients for the current week (row-wise).

In [15]:

pd.concat([df1,df2],axis=0)

,PatientID,InsuranceCovered,FinalAmount,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,2000.0,3000.0,NaN,NaN,NaN,NaN,NaN,NaN
1,102,1500.0,3500.0,NaN,NaN,NaN,NaN,NaN,NaN
2,103,2500.0,5000.0,NaN,NaN,NaN,NaN,NaN,NaN
3,104,3000.0,3200.0,NaN,NaN,NaN,NaN,NaN,NaN
4,105,1000.0,4000.0,NaN,NaN,NaN,NaN,NaN,NaN
0,101,NaN,NaN,Alice,Cardiology,Dr. Smith,5000.0,1.0,2023-01-10 09:00
1,102,NaN,NaN,Bob,Neurology,Dr. John,NaN,2.0,2023-01-11 10:30
2,103,NaN,NaN,Charlie,Orthopedics,Dr. Lee,7500.0,1.0,2023-01-12 11:00
3,104,NaN,NaN,David,Cardiology,Dr. Smith,6200.0,3.0,2023-01-13 12:00
4,105,NaN,NaN,Eva,Dermatology,Dr. Rose,NaN,2.0,2023-01-14 08:45
5,101,NaN,NaN,Alice,Cardiology,Dr. Smith,5000.0,1.0,2023-01-10 09:00

# 9.	Concatenate new billing category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise).

In [16]:
pd.concat([df1,df2],axis=1)

,PatientID,InsuranceCovered,FinalAmount,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101.0,2000.0,3000.0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102.0,1500.0,3500.0,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103.0,2500.0,5000.0,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104.0,3000.0,3200.0,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105.0,1000.0,4000.0,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,NaN,NaN,NaN,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [17]:
df2=pd.concat([df2,df1[['InsuranceCovered','FinalAmount']]],axis=1)

In [18]:
df2

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00,2000.0,3000.0
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30,1500.0,3500.0
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00,2500.0,5000.0
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00,3000.0,3200.0
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45,1000.0,4000.0
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00,NaN,NaN

# Expected Outcome Explanation
## 1. Final cleaned dataset with accurate billing info

After performing all the steps (dropping unnecessary columns, handling duplicates, filling missing values, merging billing data, and adding new columns), you will get a clean and organized dataset.

This final dataset will include:

Correct patient details

Proper billing amounts

Insurance and final amount columns

No repeated patient entries

No useless administrative columns

This means your dataset is now ready for real analysis.

# 2. All missing values handled

You filled all missing BillAmount values using the mean, so there are:

No NaN values

No blanks

No incomplete records

A clean dataset ensures that your analysis results are accurate and reliable

# 3. Merged dataset across PatientID

You combined:

The patient dataset

The billing dataset

using:

merge(patient_df, billing_df, on='PatientID')


This gives a single unified dataset where all patient information and billing information are linked correctly.

# 4. Ability to perform further analytics

After cleaning and merging, now you can perform many kinds of analysis, such as:

 Department-wise revenue

Using groupby:

df.groupby('Department')['BillAmount'].sum()


You can find:

How much each department earned

Which department performs best financially

 Doctor performance analysis

Using groupby:

df.groupby('Doctor')['BillAmount'].sum()

# You can analyze:

Which doctor generates highest revenue

Which doctor handles the most patients

Average billing per doctor

# Final Summary

A clean, merged dataset is created with all required patient and billing information.

Missing bill amounts have been filled using the mean.

Duplicates and unnecessary administrative columns are removed.

New patients and new billing category columns have been added using row-wise and column-wise concatenation.

The final dataset is ready for department-level revenue analysis and doctor-level performance analysis.